drop procedure  if exists dbo.getPlayers_for_printform
-- ================================================
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
-- =============================================
-- Author:		»ль€ ¬оронков
-- Create date: 2021-07-29
-- Description:	возвращает всех пресонажей дл€ генератора

--exec dbo.getPlayers_for_printform 
-- =============================================
CREATE PROCEDURE dbo.getPlayers_for_printform 
	-- Add the parameters for the stored procedure here
AS
BEGIN
	-- SET NOCOUNT ON added to prevent extra result sets from
	-- interfering with SELECT statements.
	SET NOCOUNT ON;

	SELECT distinct
	  'player' as objectType
	  ,p.id
	  ,p.name
	  ,count(b.id)over(partition by p.id) as [count]
  FROM [dbo].[players]p
  left join dbo.objects o on o.id=p.id and o.typeId=1
  left join sides s on s.id=p.sideid
  left join squads sq on sq.id=p.squadid
  left join bjzi b on b.playerid=p.id
  where 1=1
  and p.sideId!=16333
  --and realname is not null
  and stateid!=3
  --and squadid not in (100003,100002,100001)
  --and realname not in ('персонаж из мастерского резерва','test','виртуальный персонаж')
  and p.id in (43078,42849,42919,42923,43049,61152,48502,43105,60841,43073,59946,60840,43028,43043,50837,43057,61772,56761,43086,43186,43068,43715,42920,44166,62421,43069,44230,43234,62796,43080,48550,44248,44156,43004,44884,42866,42869,61611,63348,43006,44155,43027,43025,43033,43045,62457,43074,43058,43060,43067,43634,43854,43264,44173,43314,43046,43084,45118,44105,44229,42964,43076,43189,43083,62574,43075,43031,42911,42909,43638,43094,48549,42974,49270,42976,43109,45116,42851,43012,43036,48517,51665,60875,43313,43840,42850,44551,59948,43050,42973,43090,60675,44235,60423,43087,43052,42914,44243,49952,62291,43009,44172,62290,42873,42865,62338,42913,43102,61773,42863,42975,42912,44167,43270,43104,43056,42856,43007,59947,62067,60317,42864,61757,42981,42852,43013,43096,44159,43038,43713,49032,43030,43005,43110,43927,42855,43841,44233,43099,43095,43093,43236,60417,44228,43024,42922,44234,60965,44158,43092,43085,43082,45117,46581,61762,42903,43191,43077,42924,42956,43106,43061,62455,44245,46585,43044,42921,63077,63440,56762,43011,43070,61771,43014,43072,42896,62456,42989,43607,43714,48516,42854,63473,42853,47742,45374,43103,43230,43026,44237,62317,43855,44564,44566,61077,44568,44567,62135,44565,44561,44558,44573,44572,44574,44578)
  order by 4 desc,p.name
	
END
GO

